{
  "comments": {
    "1": [
      {
        "id": "c1",
        "author": "Sarah Mitchell",
        "timestamp": "2026-01-16T09:23:00Z",
        "body": "What an incredible journey! I've always wondered about the process behind specialty coffee. The part about Carlos and his family's four-generation legacy really touched me. It makes me appreciate my morning cup so much more."
      },
      {
        "id": "c2",
        "author": "David Park",
        "timestamp": "2026-01-16T14:45:00Z",
        "body": "The washed processing method you described is fascinating. I'd love to learn more about how different processing methods affect the final flavor. Any chance of a follow-up post on that topic?"
      },
      {
        "id": "c3",
        "author": "Emma Rodriguez",
        "timestamp": "2026-01-17T11:30:00Z",
        "body": "I tried your house roast last week after reading this, and I could definitely taste the difference. Knowing the story behind the beans makes the experience so much richer. Thank you for sharing!"
      }
    ],
    "2": [
      {
        "id": "c4",
        "author": "Michael Torres",
        "timestamp": "2026-01-09T08:15:00Z",
        "body": "The tip about water temperature was a game-changer for me. I've been using boiling water straight from the kettle for years. No wonder my coffee was always a bit bitter!"
      },
      {
        "id": "c5",
        "author": "Lisa Chen",
        "timestamp": "2026-01-10T16:20:00Z",
        "body": "Just bought a burr grinder based on your recommendation. You weren't kidding—fresh-ground coffee is like a completely different drink. My French press has never tasted better."
      }
    ],
    "3": [
      {
        "id": "c6",
        "author": "James Wilson",
        "timestamp": "2025-12-21T10:45:00Z",
        "body": "I visited Uji a few years ago and this brought back so many memories. The tea culture there is truly something special. Your description of the shading process was spot-on."
      },
      {
        "id": "c7",
        "author": "Yuki Tanaka",
        "timestamp": "2025-12-22T09:00:00Z",
        "body": "As someone who grew up near Kyoto, I'm so happy to see people appreciating traditional matcha preparation. The attention to detail you describe is exactly what makes ceremonial-grade matcha worth the extra cost."
      },
      {
        "id": "c8",
        "author": "Rachel Green",
        "timestamp": "2025-12-23T14:30:00Z",
        "body": "This explains why matcha from different sources tastes so different! I had no idea the shading process was so important. Definitely going to pay more attention to where my matcha comes from."
      },
      {
        "id": "c9",
        "author": "Tom Bradley",
        "timestamp": "2025-12-24T11:15:00Z",
        "body": "Beautiful writing. You've convinced me to try your ceremonial-grade matcha next time I'm in the shop."
      }
    ],
    "4": [
      {
        "id": "c10",
        "author": "Amanda Foster",
        "timestamp": "2025-12-13T08:30:00Z",
        "body": "The W-motion whisking tip finally helped me get that perfect froth! I've been stirring in circles like a fool this whole time. Thank you!"
      },
      {
        "id": "c11",
        "author": "Kevin Nguyen",
        "timestamp": "2025-12-14T15:45:00Z",
        "body": "Sifting really does make all the difference. I was skeptical at first, but after trying it, I can't go back. No more clumpy matcha for me."
      }
    ]
  }
}
